from aiogram import Bot
from PIL import Image
from PIL import ImageDraw, ImageFont

mytoken = "8372995576:AAEETllZlf082ZztfxS6jxYTiuBCA51gUjs"
mybot = Bot(token=mytoken)


path_to_shablon = "Sistemimages/шаблонО3.png"
path_to_prozrschniy_shablon="Sistemimages/Прозрачный шаблон.png"


shablon_picture_matrix = {
    # Первый ряд
    1: (0,210),
    2: (203,210),
    3: (406,210),
    4: (603,210),
    5: (801,210),
    # Второй ряд
    6: (0,408),
    7: (203,408),
    8: (406,408),
    9: (603,408),
    10: (801,408),
    # Третий ряд
    11: (0,606),
    12: (203,606),
    13: (406,606),
    14: (603,606),
    15: (801,606),
    # Четвёртый ряд
    16: (0,804),
    17: (203,804),
    18: (406,804),
    19: (603,804),
    20: (801,804),
    # Пятый ряд
    21: (0,1003),
    22: (203,1003),
    23: (406,1003),
    24: (603,1003),
    25: (801,1003),
    # Шестой ряд
    26: (0,1203),
    27: (203,1203),
    28: (406,1203),
    29: (603,1203),
    30: (801,1203)
}
